//=============================================================================
//
// 押したら次への処理 [player.cpp]
// Author : 佐藤瞭平
//
//=============================================================================
#include"press_next.h"
#include"renderer.h"
#include"manager.h"
#include"input.h"
#include"polygon.h"

//=============================================================================
// 静的メンバ変数の宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CPress_Next::m_pTexture = NULL;
CPolygon * CPress_Next::m_pPolygon = NULL;

//=============================================================================
// 押したら次へのコンストラクタ
//=============================================================================
CPress_Next::CPress_Next(PRIORITY nPriority) : CScene(nPriority)
{
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_size = D3DXVECTOR2(0.0f, 0.0f);
}


//=============================================================================
// 押したら次へのデストラクタ
//=============================================================================
CPress_Next::~CPress_Next()
{

}

//=============================================================================
// 押したら次への生成処理
//=============================================================================
CPress_Next *CPress_Next::Create(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXVECTOR2 Size, float fHeight)
{
	// 押したら次へのポインター生成
	CPress_Next* pPress_Next;

	// 動的メモリの確保 
	pPress_Next = new CPress_Next;

	// NULLチェック
	if (pPress_Next != NULL)
	{
		pPress_Next->m_move = move;
		pPress_Next->m_size = Size;
		pPress_Next->m_fHeight = fHeight;
		pPress_Next->Init(pos);
	}
	return pPress_Next;
}

//=============================================================================
// 押したら次への初期化処理
//=============================================================================
HRESULT CPress_Next::Init(D3DXVECTOR3 pos)
{
	// ポリゴンの生成
	m_pPolygon = CPolygon::Create(pos, m_size, 12);
	m_pos = pos;

	return S_OK;
}	// 押したら次へのプレイヤーの初期化処理終了

	//=============================================================================
	// 押したら次への終了処理
	//=============================================================================
void CPress_Next::Uninit(void)
{
	// 解放処理
	Release();

}// 押したら次への終了処理終了

 //=============================================================================
 // 押したら次への更新処理
 //=============================================================================
void CPress_Next::Update(void)
{
	// 現在位置がm_fHeightより大きかったら
	if (m_pos.y > m_fHeight)
	{
		// 現在位置の移動
		m_pos -= m_move;

		// 現在位置の更新
		m_pPolygon->SetPosition(m_pos);
	}
	// ポリゴンの更新
	m_pPolygon->Update();

}// 押したら次への更新処理終了

 //=============================================================================
 // 押したら次への描画処理
 //=============================================================================
void CPress_Next::Draw(void)
{

}	// 押したら次への描画処理終了