//=============================================================================
//
// 顔の差分の表示処理 [facialui.cpp]
// Author : 佐藤瞭平
//
//=============================================================================
#include "facialui.h"

//=============================================================================
// 顔の差分の表示のコンストラクタ
//=============================================================================
CFacialui::CFacialui(int nPriority) : CScene2D(PRIORITY_UI)
{

}

//=============================================================================
// 顔の差分の表示のデストラクタ
//=============================================================================
CFacialui::~CFacialui()
{

}

//=============================================================================
// 顔の差分の表示の生成処理
//=============================================================================
CFacialui *CFacialui::Create(D3DXVECTOR3 pos, D3DXVECTOR2 Size, int nTex)
{
	CFacialui *pFacialui = NULL;
	pFacialui = new CFacialui;

	if (pFacialui != NULL)
	{
		pFacialui->Bindtexture(nTex);
		pFacialui->Init(pos, Size);
	}
	return pFacialui;
}

//=============================================================================
// 顔の差分の表示の初期化処理
//=============================================================================
HRESULT CFacialui::Init(D3DXVECTOR3 pos, D3DXVECTOR2 Size)
{
	m_Pos = pos;
	CScene2D::Init(pos, Size);
	// アニメーションのテクスチャ設定
	SetFace(0);
	return S_OK;
}

//=============================================================================
// 顔の差分の表示の終了処理
//=============================================================================
void CFacialui::Uninit(void)
{
	//CScene2D::Uninit();
	Release();
}

//=============================================================================
// 顔の差分の表示の更新処理
//=============================================================================
void CFacialui::Update(void)
{
	CScene2D::Update();
}

//=============================================================================
// 顔の差分の表示の描画処理
//=============================================================================
void CFacialui::Draw(void)
{
	CScene2D::Draw();
}

//=============================================================================
// 顔の差分の表示の設定処理
//=============================================================================
void CFacialui::SetFace(int nFace)
{	
	switch (nFace)
	{
	case FACE_NOMAL:
		CScene2D::SetTexAnime(0, 0.25f, 0, 0.5f);
		break;
	case FACE_JOY:
		CScene2D::SetTexAnime(1, 0.25f, 0, 0.5f);
		break;
	case FACE_ANGER:
		CScene2D::SetTexAnime(2, 0.25f, 0, 0.5f);
		break;
	case FACE_SAD:
		CScene2D::SetTexAnime(3, 0.25f, 0, 0.5f);
		break;
	case FACE_SURPRISE:
		CScene2D::SetTexAnime(0, 0.25f, 0.5f, 1.0f);
		break;
	case FACE_CRYING:
		CScene2D::SetTexAnime(1, 0.25f, 0.5f, 1.0f);
		break;
	default:
		break;
	}
}