//=============================================================================
//
// アイテムの処理 [score.cpp]
// Author : 佐藤瞭平
//
//=============================================================================
#include "item.h"
#include"player.h"

//=============================================================================
// アイテムのコンストラクタ
//=============================================================================
CItem::CItem(int nPriority) : CScene2D(PRIORITY_ITEM)
{


}

//=============================================================================
// アイテムのデストラクタ
//=============================================================================
CItem::~CItem()
{

}

//=============================================================================
// アイテムの生成処理
//=============================================================================
CItem *CItem::Create(D3DXVECTOR3 pos, D3DXVECTOR2 Size)
{
	CItem *pItem = NULL;
	pItem = new CItem;

	if (pItem != NULL)
	{
		pItem->Init(pos, Size);
		pItem->Bindtexture(17);
	}
	return pItem;
}

//=============================================================================
// アイテムの初期化処理
//=============================================================================
HRESULT CItem::Init(D3DXVECTOR3 pos, D3DXVECTOR2 Size)
{
	m_pos = pos;
	m_size = Size;
	CScene2D::Init(pos,Size);
	return S_OK;
}

//=============================================================================
// アイテムの終了処理
//=============================================================================
void CItem::Uninit(void)
{
	Release();
}

//=============================================================================
// アイテムの更新処理
//=============================================================================
void CItem::Update(void)
{
	Colision();
	CScene2D::Update();
}

//=============================================================================
// アイテムの描画処理
//=============================================================================
void CItem::Draw(void)
{
	CScene2D::Draw();
}

//=============================================================================
// アイテムの当たり判定処理
//=============================================================================
void CItem::Colision(void)
{
	int nItem = CPlayer::GetItem();

	//=============================================================================
	// 自機の弾と敵の当たり判定
	//=============================================================================
	for (int nPriority = 0; nPriority < PRIORITY_MAX; nPriority++)
	{
		CScene * pScene = NULL;

		pScene = CScene::GetScene(nPriority);

		if (pScene != NULL)
		{
			if (nPriority == CScene::PRIORITY_PLAYER)
			{
				CPlayer *pPlayer = (CPlayer*)pScene;

				if (m_pos.x + (m_size.x / 2) >= pPlayer->GetPos().x - pPlayer->GetSize().x &&
					m_pos.x - (m_size.x / 2) <= pPlayer->GetPos().x + pPlayer->GetSize().x &&
					m_pos.y + (m_size.y / 2) >= pPlayer->GetPos().y - pPlayer->GetSize().y &&
					m_pos.y - (m_size.y / 2) <= pPlayer->GetPos().y + pPlayer->GetSize().y)
				{
					Uninit();
					CPlayer::SetItem(nItem + 1);
					return;
				}
			}
		}
	}
}