//=============================================================================
//
// ステージ処理 [stage.h]
// Author : 佐藤瞭平
//
//=============================================================================
#ifndef _STAGE_TOP_H_
#define _STAGE_TOP_H_

#include"stage.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CGoal;
class CPlayer;
//*****************************************************************************
// ステージクラス
//*****************************************************************************
class CStage_Top : public CStage
{
public:																// 誰でもアクセス可能
	CStage_Top();													// コンストラクタ
	~CStage_Top();													// デストラクタ
																	// メンバ関数	
	HRESULT Init(D3DXVECTOR3 pos);									// ゲームのステージの初期化関数
	void Uninit(void);												// ゲームのステージの終了関数
	void Update(void);												// ゲームのステージの更新関数
	void Draw(void);												// ゲームのステージの描画関数	


private:															// 自分だけがアクセス可能
};
#endif