//=============================================================================
//
// ステージ処理 [stage.h]
// Author : 佐藤瞭平
//
//=============================================================================
#ifndef _STAGE_TUTORIAL_H_
#define _STAGE_TUTORIAL_H_

#include"stage.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CGoal;
//*****************************************************************************
// ステージクラス
//*****************************************************************************
class CStage_Tutorial : public CStage
{
public:																// 誰でもアクセス可能
	CStage_Tutorial();												// コンストラクタ
	~CStage_Tutorial();												// デストラクタ
																	// メンバ関数
	HRESULT Init(D3DXVECTOR3 pos);									// ステージの選択の初期化関数
	void Uninit(void);												// ステージの選択の終了関数
	void Update(void);												// ステージの選択の更新関数
	void Draw(void);												// ステージの選択の描画関数	


private:															// 自分だけがアクセス可能
	
};
#endif