//=============================================================================
//
// 弾の処理 [billboard.cpp]
// Author : 佐藤瞭平
//
//=============================================================================
#include"bullet.h"
#include "input.h"
#include "Renderer.h"
#include "manager.h"
#include"scene3D.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CBullet::CBullet(PRIORITY nPriority) :CBillboard(nPriority)
{
	m_nLife = 0;
	m_bUse = true;
}

//=============================================================================
// デストラクタ
//=============================================================================
CBullet::~CBullet()
{

}

//=============================================================================
// 弾の生成処理
//=============================================================================
CBullet *CBullet::Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, int nLife)
{
	// 弾のポインター生成
	CBullet* pBullet = NULL;

	// 動的メモリの確保
	pBullet = new CBullet;

	//　NULLチェック
	if (pBullet != NULL)
	{
		pBullet->Init(pos, size);
		pBullet->m_nLife = nLife;
		pBullet->BindTextuer(3);
	}
	return pBullet;
}

//=============================================================================
// 弾の初期化処理
//=============================================================================
HRESULT CBullet::Init(D3DXVECTOR3 pos, D3DXVECTOR2 size)
{
	// 継承先の初期化処理を呼び出す
	CBillboard::Init(pos, size);

	m_pos = pos;
	m_size = size;

	return S_OK;
}

//=============================================================================
// 弾の終了処理
//=============================================================================
void CBullet::Uninit(void)
{
	// 継承先の終了処理を呼び出す
	//CBillboard::Uninit();

	Release();
}

//=============================================================================
// 弾の更新処理
//=============================================================================
void CBullet::Update(void)
{
	// 使わなくしたら
	if (!m_bUse)
	{
		Uninit();
		return;
	}
	else
	{
		// 体力を減らす
		m_pos.z += 1.0f;

		// 体力を減らす
		m_nLife--;

		// 体力0以下になったとき
		if (m_nLife <= 0)
		{// 体力0にする
			m_nLife = 0;
			// 使わなくする
			m_bUse = false;
		}
		SetPosSize(m_pos,m_size);
	}

	// 継承先の更新処理を呼び出す
	CBillboard::Update();
}

//=============================================================================
// 弾の描画処理
//=============================================================================
void CBullet::Draw(void)
{
	// 継承先の描画処理を呼び出す
	CBillboard::Draw();
}