//=============================================================================
//
//ライトの処理[light.h]
// Author : 佐藤瞭平
//
//=============================================================================
#ifndef _LIGHT_H_//endifとセット（必ず一番上
#define _LIGHT_H_

#include"main.h"

//*****************************************************************************
// ライトクラス
//*****************************************************************************
class CLight
{
public:													// 誰でもアクセス可能

	CLight();											// コンストラクタ
	~CLight();											// デストラクタ
	HRESULT Init(D3DXVECTOR3 vec,D3DXCOLOR col);		// 初期化関数
	void Uninit(void);									// 終了関数
	void Update(void);									// 更新関数

private:												// 自分だけがアクセス可能
	D3DLIGHT9 m_light;									// ライトの情報
	static int m_nCntLight;								// ライトの生成数のカウント
	int m_nNumLight;									// ライトの生成数
};
#endif //_LIGHT_H_//ifndefとセット（必ず一番下
