//=============================================================================
//
// チュートリアルの処理 [tutorial.h]
// Author : 佐藤瞭平
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "scene.h"

//*****************************************************************************
//	前方宣言
//*****************************************************************************
class CBg;

//*****************************************************************************
// タイトルのクラス
//*****************************************************************************
class CTutorial : public CScene
{
public:
	CTutorial(int nPriority = PRIORITY_NOMAL);										// コンストラクタ
	~CTutorial();																	// デストラクタ

																				// メンバ関数
	HRESULT Init(D3DXVECTOR3 pos);												// チュートリアルの初期化関数
	void Uninit(void);															// チュートリアルの終了関数　
	void Update(void);															// チュートリアルの更新関数
	void Draw(void);															// チュートリアルの描画関数

private:																		// 自分だけがアクセス可能	
	static CBg * m_pBg;															// 背景のポインター
	bool m_bFade;
};

#endif